src/Catalogs/ВидыРабочихЦентров/ВидыРабочихЦентров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыРабочихЦентров</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПланироватьРаботу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйЗначимыйБуфер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьДоступностьПоГрафикуРаботы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Календарь</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяДоступностьРЦ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияДоступностиРЦ</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОжидания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуютсяВариантыНаладки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаВремениПереналадки</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РезервДоступности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПараллельнаяЗагрузка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияЗагрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантЗагрузки</name>
    <type>
      <types>EnumRef.ВариантыЗагрузкиРабочихЦентров</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланироватьРаботуРабочихЦентров</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРабочихЦентров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВводитьДоступностьДляВидаРЦ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/ТочностьГрафикаПроизводства/ТочностьГрафикаПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТочностьГрафикаПроизводства</name>
  <enumValues>
    <name>Час</name>
  </enumValues>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ЕдиницыИзмеренияВремени/ЕдиницыИзмеренияВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЕдиницыИзмеренияВремени</name>
  <enumValues>
    <name>Секунда</name>
  </enumValues>
  <enumValues>
    <name>Минута</name>
  </enumValues>
  <enumValues>
    <name>Час</name>
  </enumValues>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Сутки</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
  <enumValues>
    <name>Год</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ВариантыНаладки/ВариантыНаладки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВариантыНаладки</name>
  <owners>Catalog.ВидыРабочихЦентров</owners>
  <attributes>
    <name>ВремяРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветОформления</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/РабочиеЦентры/РабочиеЦентры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РабочиеЦентры</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидРабочегоЦентра</name>
    <type>
      <types>CatalogRef.ВидыРабочихЦентров</types>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентВремениРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяЗагрузка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Календарь</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РасценкаРабота</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>РасценкаПереналадка</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.ПроизводственныеУчастки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ВидыРабочихЦентров/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает имена блокируемых реквизитов для механизма блокирования реквизитов БСП
//
// Возвращаемое значение:
//	Массив - имена блокируемых реквизитов.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("Подразделение");
	Результат.Добавить("ИспользуютсяВариантыНаладки");
	Результат.Добавить("ЕдиницаВремениПереналадки");
	Результат.Добавить("ПараллельнаяЗагрузка");
	Результат.Добавить("ЕдиницаИзмеренияЗагрузки");
	Результат.Добавить("ВариантЗагрузки;ВариантЗагрузкиАсинхронный,ВариантЗагрузкиСинхронный1,ВариантЗагрузкиСинхронный2");
	
	Возврат Результат;
	
КонецФункции

// Возвращает имена реквизитов, которые не должны отображаться в списке реквизитов обработки ГрупповоеИзменениеОбъектов.
//
//	Возвращаемое значение:
//		Массив - массив имен реквизитов.
//
Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт
	
	НеРедактируемыеРеквизиты = Новый Массив;
	НеРедактируемыеРеквизиты.Добавить("Подразделение");
	
	Возврат НеРедактируемыеРеквизиты;
	
КонецФункции

// Возвращает максимальную доступность видов РЦ в интервале планирования.
//
// Параметры:
//  ВидыРабочихЦентров	 - Массив - ссылки на виды рабочих центров.
// 
// Возвращаемое значение:
//  Соответствие - ключ - ссылка на вид РЦ, значение - максимальная доступность.
//
Функция МаксимальнаяДоступностьВСекундах(ВидыРабочихЦентров) Экспорт
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ВидыРабочихЦентров.Ссылка КАК Ссылка,
		|	ВидыРабочихЦентров.МаксимальнаяДоступностьРЦ КАК МаксимальнаяДоступность,
		|	ВидыРабочихЦентров.ЕдиницаИзмеренияДоступностиРЦ КАК ЕдиницаИзмеренияДоступности,
		|	ВидыРабочихЦентров.Подразделение.ИнтервалПланирования КАК ИнтервалПланирования
		|ИЗ
		|	Справочник.ВидыРабочихЦентров КАК ВидыРабочихЦентров
		|ГДЕ
		|	ВидыРабочихЦентров.Ссылка В(&Ссылки)");
	
	Запрос.УстановитьПараметр("Ссылки", ВидыРабочихЦентров);
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
		
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.МаксимальнаяДоступность) Тогда
			
			Доступность = ПланированиеПроизводстваКлиентСервер.ПолучитьВремяВСекундах(
				Выборка.МаксимальнаяДоступность,
				Выборка.ЕдиницаИзмеренияДоступности);
				
		Иначе
			
			Если Выборка.ИнтервалПланирования = Перечисления.ТочностьГрафикаПроизводства.Час Тогда
				Доступность = 3600;
			ИначеЕсли Выборка.ИнтервалПланирования = Перечисления.ТочностьГрафикаПроизводства.День Тогда
				Доступность = 86400;
			ИначеЕсли Выборка.ИнтервалПланирования = Перечисления.ТочностьГрафикаПроизводства.Неделя Тогда
				Доступность = 604800;
			ИначеЕсли Выборка.ИнтервалПланирования = Перечисления.ТочностьГрафикаПроизводства.Месяц Тогда
				Доступность = 2592000; // 30 дней
			КонецЕсли;
			
		КонецЕсли;
		
		Результат.Вставить(Выборка.Ссылка, Доступность);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает значения реквизитов вида рабочего центра
// 
// Параметры:
// 	ВидРабочегоЦентра - СправочникСсылка.ВидыРабочихЦентров,СправочникСсылка.РабочиеЦентры
// 	ВариантНаладки - СправочникСсылка.ВариантыНаладки
// Возвращаемое значение:
// 	См. СтруктураРеквизитовВидаРабочегоЦентра
Функция ЗначенияРеквизитовВидаРабочегоЦентра(ВидРабочегоЦентра, ВариантНаладки = Неопределено) Экспорт
	
	Результат = СтруктураРеквизитовВидаРабочегоЦентра();
	
	Если ЗначениеЗаполнено(ВидРабочегоЦентра) Тогда
		
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ВидыРабочихЦентров.ИспользуютсяВариантыНаладки      КАК ИспользуютсяВариантыНаладки,
		|	ВидыРабочихЦентров.ПараллельнаяЗагрузка             КАК ПараллельнаяЗагрузка,
		|	ВидыРабочихЦентров.ЕдиницаИзмеренияЗагрузки         КАК ЕдиницаИзмеренияЗагрузки,
		|	ВидыРабочихЦентров.ВариантЗагрузки                  КАК ВариантЗагрузки,
		|	ВЫБОР
		|		КОГДА ВидыРабочихЦентров.ВариантЗагрузки = ЗНАЧЕНИЕ(Перечисление.ВариантыЗагрузкиРабочихЦентров.Синхронный)
		|					И ВидыРабочихЦентров.ИспользуютсяВариантыНаладки
		|			ТОГДА ЕСТЬNULL(ВариантыНаладки.ВремяРаботы, 0)
		|		ИНАЧЕ ВидыРабочихЦентров.ВремяРаботы
		|	КОНЕЦ                                               КАК ВремяРаботы,
		|	ВЫБОР
		|		КОГДА ВидыРабочихЦентров.ВариантЗагрузки = ЗНАЧЕНИЕ(Перечисление.ВариантыЗагрузкиРабочихЦентров.Синхронный)
		|					И ВидыРабочихЦентров.ИспользуютсяВариантыНаладки
		|			ТОГДА ЕСТЬNULL(ВариантыНаладки.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Перечисление.ЕдиницыИзмеренияВремени.ПустаяСсылка))
		|		ИНАЧЕ ВидыРабочихЦентров.ЕдиницаИзмерения
		|	КОНЕЦ                                               КАК ЕдиницаИзмерения
		|
		|ИЗ
		|	Справочник.ВидыРабочихЦентров КАК ВидыРабочихЦентров
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыНаладки КАК ВариантыНаладки
		|		ПО ВариантыНаладки.Владелец = ВидыРабочихЦентров.Ссылка
		|			И ВариантыНаладки.Ссылка = &ВариантНаладки
		|
		|ГДЕ
		|	ВидыРабочихЦентров.Ссылка = &ВидРабочегоЦентра
		|		ИЛИ ИСТИНА В (
		|				ВЫБРАТЬ ПЕРВЫЕ 1
		|					ИСТИНА
		|				ИЗ
		|					Справочник.РабочиеЦентры КАК Т
		|				ГДЕ
		|					Т.Ссылка= &ВидРабочегоЦентра
		|					И Т.ВидРабочегоЦентра = ВидыРабочихЦентров.Ссылка)
		|";
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("ВидРабочегоЦентра", ВидРабочегоЦентра);
		Запрос.УстановитьПараметр("ВариантНаладки",    ВариантНаладки);
		
		УстановитьПривилегированныйРежим(Истина);
		Выборка = Запрос.Выполнить().Выбрать();
		УстановитьПривилегированныйРежим(Ложь);
		
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(Результат, Выборка);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру реквизитов вида рабочего центра
//
// Возвращаемое значение:
//  Структура - содержит:
//   * ИспользуютсяВариантыНаладки - Булево
//   * ПараллельнаяЗагрузка - Булево
//   * ВремяРаботы - Число
//   * ЕдиницаИзмерения - ПеречислениеСсылка.ЕдиницыИзмеренияВремени
//   * ВариантЗагрузки - ПеречислениеСсылка.ВариантыЗагрузкиРабочихЦентров
//   * ЕдиницаИзмеренияЗагрузки - Строка
Функция СтруктураРеквизитовВидаРабочегоЦентра()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ИспользуютсяВариантыНаладки", Ложь);
	Результат.Вставить("ПараллельнаяЗагрузка",        Ложь);
	
	Результат.Вставить("ВремяРаботы",                 0);
	Результат.Вставить("ЕдиницаИзмерения",            Перечисления.ЕдиницыИзмеренияВремени.ПустаяСсылка());
	
	Результат.Вставить("ВариантЗагрузки",             Перечисления.ВариантыЗагрузкиРабочихЦентров.ПустаяСсылка());
	Результат.Вставить("ЕдиницаИзмеренияЗагрузки",    "");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
